app/views/user_reclamations/index.html.erb

SELECT "reclamations".* FROM "reclamations" ORDER BY "reclamations"."titre" ASC
---
                  <ul class="dropdown-menu">
                    <% Reclamation.all.order(:titre).each do |r| %>