app/views/reclamations/show.html.erb

SELECT "reclamations".* FROM "reclamations" ORDER BY "reclamations"."titre" ASC
---
                  <ul class="dropdown-menu">
                    <% Reclamation.all.order(:titre).each do |r| %>

SELECT "user_reclamations".* FROM "user_reclamations" WHERE "user_reclamations"."resolu" = $1 AND "user_reclamations"."reclamation_id" = $2  [["resolu", true], ["reclamation_id", 4]]
SELECT COUNT(*) FROM "user_reclamations" WHERE "user_reclamations"."resolu" = $1 AND "user_reclamations"."reclamation_id" = $2  [["resolu", true], ["reclamation_id", 4]]
---
                <a style="color: black; margin: 0px;" href="<%= fichier_reclamation_path(1) %>">
                  <% if UserReclamation.where(resolu: true).count > 1 %>