app/controllers/reclamations_controller.rb

  def show
    @user_reclamations = UserReclamation.where(reclamation_id: @reclamation.id)
    @nouvelles = UserReclamation.where(vue: false, reclamation_id: @reclamation.id)
    @attentes = UserReclamation.where(vue: true ,resolu: false, reclamation_id: @reclamation.id)
    @valides = UserReclamation.where(resolu: true, reclamation_id: @reclamation.id)
---
SELECT "user_reclamations".* FROM "user_reclamations" WHERE "user_reclamations"."vue" = $1 AND "user_reclamations"."reclamation_id" = $2  [["vue", false], ["reclamation_id", 4]]
SELECT "user_reclamations".* FROM "user_reclamations" WHERE "user_reclamations"."vue" = $1 AND "user_reclamations"."resolu" = $2 AND "user_reclamations"."reclamation_id" = $3  [["vue", true], ["resolu", false], ["reclamation_id", 4]]
SELECT "user_reclamations".* FROM "user_reclamations" WHERE "user_reclamations"."resolu" = $1 AND "user_reclamations"."reclamation_id" = $2  [["resolu", true], ["reclamation_id", 4]]

    def set_reclamation
      @reclamation = Reclamation.find(params[:id])
---
SELECT "reclamations".* FROM "reclamations" WHERE "reclamations"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]