app/controllers/user_reclamations_controller.rb

SELECT "user_reclamations".* FROM "user_reclamations" WHERE "user_reclamations"."vue" = $1  [["vue", false]]
SELECT "user_reclamations".* FROM "user_reclamations" WHERE "user_reclamations"."vue" = $1 AND "user_reclamations"."resolu" = $2  [["vue", true], ["resolu", false]]
---
  def index
    @user_reclamations = UserReclamation.all
    @nouvelles = UserReclamation.where(vue: false)
    @attentes = UserReclamation.where(vue: true ,resolu: false)